# Missing Data

Common methods to handle missing data in pandas:
___

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'A':[1,2,np.nan,3], 'B':[5,np.nan,np.nan,87], 'C':[1,2,3,4], 'D':['boo',np.nan,'soup',np.nan]})
df

     A     B  C     D
0  1.0   5.0  1   boo
1  2.0   NaN  2   NaN
2  NaN   NaN  3  soup
3  3.0  87.0  4   NaN

In [3]:
# The .dropna(inplace = True) method. Default drop for rows. Inplacement inccur permanent changes.

     A    B  C    D
0  1.0  5.0  1  boo

In [4]:
# parameter axis=1 refers to columns

   C
0  1
1  2
2  3
3  4

In [9]:
# Threshold refers to minimum number of non-NaN values for retaining row/column (parameter input in integer)

     A     B  C    D
0  1.0   5.0  1  boo
3  3.0  87.0  4  NaN

In [11]:
# The .fillna(new_value) method
# Replacement of NaN with a designated value

             A            B  C          D
0          1.0          5.0  1        boo
1          2.0  999888766.0  2  999888766
2  999888766.0  999888766.0  3       soup
3          3.0         87.0  4  999888766

0       5.0
1    NOOOOO
2    NOOOOO
3      87.0
Name: B, dtype: object

     A     B  C     D
0  1.0   5.0  1   boo
1  2.0   NaN  2   NaN
2  NaN   NaN  3  soup
3  3.0  87.0  4   NaN

In [19]:
# Fill NaN with the mean of the column A. Do one column at a time.

0    1.0
1    2.0
2    2.0
3    3.0
Name: A, dtype: float64

In [20]:
# Fill NaN with the median of the column B.

0     5.0
1    46.0
2    46.0
3    87.0
Name: B, dtype: float64

___